<?php
    // 自分の得意な言語で
    // Let's チャレンジ！！
    $input_line = explode(" ", trim(fgets(STDIN)));
    $H = $input_line[0];
    $W = $input_line[1];
    //echo $H.$W;
    
    $s = "#";
    $ban = array();
    
    for($y=0; $y<$H; $y++)
    {
        $line = str_split(trim(fgets(STDIN)));
        
        for($x=0; $x<$W; $x++)
        {
            $ban[$y][$x] = $line[$x];
        }
    }
    //echo "ban[0][0] ". $ban[0][0]. "\n";
    //echo "ban[$H-1][$W-1] ". $ban[$H-1][$W-1] . "\n";
   
   $a = "";
   for($y=0; $y<$H; $y++)
   {
       for($x=0; $x<$W; $x++)
        {
           //四隅 
           if(($y==0)&&($x==0))
           {
                if(($ban[$y+1][$x] == $s)&&($ban[$y][$x+1] == $s))
                {
                    $a .= $y. " ". $x. "\n";
                }
           } //ひだりうえ
           elseif(($y==0)&&($x==$W-1))
           {
                if(($ban[$y][$x-1] == $s)&&($ban[$y+1][$x] == $s))
                {
                    $a .= $y. " ". $x. "\n";
                }
           }// みぎうえ
           elseif(($y==$H-1)&&($x==0))
           {
                if(($ban[$y-1][$x] == $s)&&($ban[$y][$x+1] == $s))
                {
                    $a .= $y. " ". $x. "\n";
                }
           } //ひだりした
           elseif(($y==$H-1)&&($x==$W-1))
           {
                if(($ban[$y][$x-1] == $s)&&($ban[$y-1][$x] == $s))
                {
                    $a .= $y. " ". $x. "\n";
                }
           }// みぎした
           
           
           elseif(($y==0)&&($x>0)&&($x<$W-1))
           {
               if(($ban[$y][$x-1] == $s)
               &&($ban[$y][$x+1] == $s)
               &&($ban[$y+1][$x] == $s))
                {
                    $a .= $y. " ". $x. "\n";
                }
           }//上
           elseif(($x==0)&&($y>0)&&($y<$H-1))
           {
               if(($ban[$y][$x+1] == $s)
               &&($ban[$y-1][$x] == $s)
               &&($ban[$y+1][$x] == $s))
                {
                    $a .= $y. " ". $x. "\n";
                }
           }//ひだり
           elseif(($x==($W-1))&&($y>0)&&($y<$H-1))
           {
               if(($ban[$y][$x-1] == $s)
               &&($ban[$y-1][$x] == $s)
               &&($ban[$y+1][$x] == $s))
                {
                    $a .= $y. " ". $x. "\n";
                }
           }//みぎ
           elseif(($y==($H-1))&&($x>0)&&($x<$W-1))
           {
               if(($ban[$y][$x-1] == $s)
               &&($ban[$y][$x+1] == $s)
               &&($ban[$y-1][$x] == $s))
                {
                    $a .= $y. " ". $x. "\n";
                }
           }//した
           
           else{
               if(($ban[$y][$x-1] == $s)
               &&($ban[$y][$x+1] == $s)
               &&($ban[$y-1][$x] == $s)
               &&($ban[$y+1][$x] == $s))
                {
                    $a .= $y. " ". $x. "\n";
                }
           }
        }
   }
   

   
   
   
    
//ただし、左端のマスの場合は「右のマスが '#' 」であれば、右端のマスの場合は「左のマスが '#' 」であれば隣接する左右のマスが全て '#' であるものとします。
///また、上端のマスの場合は「下のマスが '#' 」であれば、下端のマスの場合は「上のマスが '#' 」であれば隣接する上下のマスが全て "#" であるものとします。
    
    
    echo $a;
    
    
?>