<?php
// 出力する盤面の情報と石を置くマスの情報が与えられます。
// 石を置いたマスを '!' に、石を置いたマスと行または列が同じマスを '*' に、それ以外のマスを '.' にした盤面を出力してください。
// 
// なお、マスの座標系は左上端のマスの座標を ( y , x ) = ( 0 , 0 ) とし、
// 下方向が y 座標の正の向き、右方向が x 座標の正の向きとします。
// 
// H W Y X
// 
// ・ 出力する盤面の行数 H , 列数 W と石を置くマスの y , x 座標である Y , X が 1 行で与えられます。
    
    list($H, $W, $Y, $X) = array_map('intval', explode(" ", (trim(fgets(STDIN)))));
    
    $b = [];
    for($i=0;$i<$H;$i++)
    {
        for($j=0;$j<$W;$j++)
        {
            if($i==$X&&$j==$Y)
            {
                $b[$i][$j] = "!";
            }
            else {
                $b[$i][$j] = ".";
                $b[$i][$X] = "*";
                $b[$Y][$j] = "*";
            }
            echo $b[$i][$j];
        }
        echo "\n";
    }
    
    
?>