<?php
// 盤面の情報とマスを '?' にする距離の個数 N, マスを '?' にするときの距離 l_i が与えられます。
// 現在プレイヤーのいるマスは '*' になっており、そのマスはプレイヤーの陣地です。
// ・ 現在の陣地から 1 マス移動することで到達できるマスをプレイヤーの陣地にして、'*' にする。
// ただし、障害物( '#' )のマスは陣地にできない。また、プレイヤーの開始時の位置からの距離が l_i であるとき、'*' の代わりに '?' にする。
// なお、はじめにプレイヤーのいるマスの開始時の位置からの距離は 0 とします。
// 
// H W N       
// S_0     
// ...     
// S_(H-1)     
// l_1     
// ...     
// l_N
// 
// ・ 1 行目では、盤面の行数 H , 列数 W , l の入力の回数 N が与えられます。
// ・ 続く H 行のうち i 行目 (0 ≦ i < H) には、盤面の i 行目の文字をまとめた文字列 S_i が与えられ、S_i の j 文字目は、盤面の i 行目の j 列目に書かれている文字を表します。(0 ≦ j < W)
// ・ 続く N 行では、マスを '?' にするときの開始時の位置からの距離 l_i が与えられます。(1 ≦ i ≦ N)

    // 盤面の行数 H , 列数 W , l の入力の回数 N 
    list($H, $W, $N) = array_map('intval', explode(" ", trim(fgets(STDIN))));
    
    $map = [];
    $q = [];
    $sy = $sx = 0;
    for($i=0;$i<$H;$i++)
    {
        $line = str_split(trim(fgets(STDIN)));
        for($j=0;$j<$W;$j++)
        {
            $map[$i][$j] = $line[$j];
            if($map[$i][$j]=="*")
            {
                // list($sy, $sx) = [$i, $j];
                $q[] = [$i, $j, 0];
            }
            //echo $map[$i][$j];
        }
        //echo "\n";
    }
    
    $dy=[-1,0,1,0];
    $dx=[0,1,0,-1];
    while(!empty($q))
    {
        list($y, $x, $n) = array_shift($q);
        
        for($k=0;$k<4;$k++)
        {
            $ny = $y + $dy[$k];
            $nx = $x + $dx[$k];
            
            if(isset($map[$ny][$nx])&&$map[$ny][$nx]==".")
            {
                $map[$ny][$nx] = (string)($n+1);
                $q[] = [$ny, $nx, $n+1];
            }
        }
    }
    
    $l = [];
    for($i=0;$i<$N;$i++)
    {
        $l[$i] = trim(fgets(STDIN));
    }
    
    for($k=0;$k<$N;$k++)
    {
        for($i=0;$i<$H;$i++)
        {
            for($j=0;$j<$W;$j++)
            {
                if($map[$i][$j]==(string)$l[$k])
                {
                    $map[$i][$j] = "?";
                }
            }
        }
    }
    
    
    // 数字を"*"にもどして出力
    for($i=0;$i<$H;$i++)
    {
        for($j=0;$j<$W;$j++)
        {
            if(is_numeric($map[$i][$j]))
            {
                $map[$i][$j] = "*";
            }
            echo $map[$i][$j];
        }
        echo "\n";
    }    
    
?>